## Key data structures in pandas

 - Series ( 1D )
 - DataFrame ( 2D )

In [71]:
import pandas as pd

In [72]:
a=pd.Series([1,2,3,4,5])
s= pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])

In [73]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [74]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [75]:
# 2 dimensional data structure is dataframe
s= pd.DataFrame({'roll no.':[1,2,3,4,5], 'name':["harry","vinay","harry","vinay","harish"]} )#, index=['a','b','c','d','e'])

In [76]:
s

   roll no.    name
0         1   harry
1         2   vinay
2         3   harry
3         4   vinay
4         5  harish

In [77]:
df = pd.read_csv('data/PandasCSV.csv', sep=';', skipinitialspace=True)

In [78]:
df

    Username  Identifier  First name Last name
0  booker12         9012  Rachel        Booker
1  grey07           2070  Laura           Grey
2  johnson81        4081  Craig        Johnson
3  jenkins46        9346  Mary         Jenkins
4  smith79          5079  Jamie          Smith

In [79]:
df.describe()

        Identifier
count     5.000000
mean   5917.600000
std    3170.552523
min    2070.000000
25%    4081.000000
50%    5079.000000
75%    9012.000000
max    9346.000000

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Username    5 non-null      object
 1   Identifier  5 non-null      int64
 2   First name  5 non-null      object
 3   Last name   5 non-null      object
dtypes: int64(1), object(3)
memory usage: 292.0+ bytes

## Data Selection

In [81]:
type(df)

pandas.core.frame.DataFrame

In [82]:
type(df["Username"])

pandas.core.series.Series

In [83]:
df[["Username","Identifier"]]

    Username  Identifier
0  booker12         9012
1  grey07           2070
2  johnson81        4081
3  jenkins46        9346
4  smith79          5079

In [84]:
df["Username"]

0    booker12
1    grey07
2    johnson81
3    jenkins46
4    smith79
Name: Username, dtype: object

In [85]:
df.iloc[0]

Username       booker12
Identifier          9012
First name    Rachel
Last name         Booker
Name: 0, dtype: object

In [86]:
type(df.iloc[0])

pandas.core.series.Series

In [87]:
df2 = pd.read_csv("data/data.csv", sep=';', skipinitialspace=True)

In [88]:
df2.head()

    Username  Identifier  First name Last name
0  booker12       9012.0  Rachel        Booker
1  grey07            NaN  Laura           Grey
2        NaN      4081.0  Craig        Johnson
3  jenkins46      9346.0         NaN   Jenkins
4  smith79        5079.0  Jamie          Smith

In [89]:
# remove data with missing data
df2.dropna()

    Username  Identifier  First name Last name
0  booker12       9012.0  Rachel        Booker
4  smith79        5079.0  Jamie          Smith

In [90]:
df2.fillna("removed") #only shows replaced value without replacing them actually
# df2.fillna("removed", inplace=True) changes data in original data frame

    Username Identifier  First name Last name
0  booker12      9012.0  Rachel        Booker
1  grey07       removed  Laura           Grey
2    removed     4081.0  Craig        Johnson
3  jenkins46     9346.0     removed   Jenkins
4  smith79       5079.0  Jamie          Smith

## changing entity names or type

In [91]:
df.rename(columns={"Username":"UN"})

          UN  Identifier  First name Last name
0  booker12         9012  Rachel        Booker
1  grey07           2070  Laura           Grey
2  johnson81        4081  Craig        Johnson
3  jenkins46        9346  Mary         Jenkins
4  smith79          5079  Jamie          Smith

In [92]:
df['Identifier'] = df["Identifier"].astype('string') #it also changed database

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Username    5 non-null      object
 1   Identifier  5 non-null      string
 2   First name  5 non-null      object
 3   Last name   5 non-null      object
dtypes: object(3), string(1)
memory usage: 292.0+ bytes

In [94]:
df["Identifier"][0]

'9012'

In [95]:
len(df)

5

In [96]:
df["Zeroes"] = df["Identifier"].str.startswith("9") #adding new column based on condition
df["heroes"] = [0 for i in range(len(df))] #adding new column with default value

In [97]:
df

    Username Identifier  First name Last name  Zeroes  heroes
0  booker12        9012  Rachel        Booker    True       0
1  grey07          2070  Laura           Grey   False       0
2  johnson81       4081  Craig        Johnson   False       0
3  jenkins46       9346  Mary         Jenkins    True       0
4  smith79         5079  Jamie          Smith   False       0

In [100]:
def fx(a):
    return (a + 1)*2
df["Zeroes+1"] = df["Zeroes"].apply(fx) #adding new column based on function

In [101]:
df

    Username Identifier  First name Last name  Zeroes  heroes  Zeroes+1
0  booker12        9012  Rachel        Booker    True       0         4
1  grey07          2070  Laura           Grey   False       0         2
2  johnson81       4081  Craig        Johnson   False       0         2
3  jenkins46       9346  Mary         Jenkins    True       0         4
4  smith79         5079  Jamie          Smith   False       0         2

In [102]:
df.to_csv("data/panda.csv", index=False) #saves the dataframe to csv file  without index

In [103]:
df1 = pd.DataFrame({'Name':["harry","vinay","harry","vinay","harish"], 
                    "Marks":[10,20,30,40,50]})
df1

     Name  Marks
0   harry     10
1   vinay     20
2   harry     30
3   vinay     40
4  harish     50

In [105]:
df2 = pd.DataFrame({'Name':["har","vin","herr","von","hari"], 
                    "Marks":[10,20,30,40,50]})
df2

   Name  Marks
0   har     10
1   vin     20
2  herr     30
3   von     40
4  hari     50

In [107]:
pd.concat([df1, df2], ignore_index=True) #concatenates two dataframes

     Name  Marks
0   harry     10
1   vinay     20
2   harry     30
3   vinay     40
4  harish     50
5     har     10
6     vin     20
7    herr     30
8     von     40
9    hari     50

In [108]:
df1 = pd.DataFrame({'Name':["har","vin"], 
                    "Marks":[10,20]})
df1

  Name  Marks
0  har     10
1  vin     20

In [112]:
df2 = pd.DataFrame({'Name':["har","vin","harry"], 
                    "Perks":[10,20,40]})
df2

    Name  Perks
0    har     10
1    vin     20
2  harry     40

In [113]:
pd.merge(df1, df2, on="Name") # merges two dataframes based on common column

  Name  Marks  Perks
0  har     10     10
1  vin     20     20

In [114]:
dict1= {
    'Name':["har","vin"], 
    "Marks":[10,20]
    }

In [121]:
df= pd.DataFrame(dict1, index=[1,2]) #creating dataframe from dictionary
df

  Name  Marks
1  har     10
2  vin     20